app/Controllers/EmployeeController.php

SELECT *
FROM `m_employee`
---
    public function listEmployee()
    {
        $employees = $this->employeeModel->findAll();

INSERT INTO `m_employee` (`nama_karyawan`, `tanggal_lahir`, `alamat`, `valid_from`) VALUES ('latifa', '2024-10-01', 'depok', '2024-10-15')
INSERT INTO `m_family` (`m_employee_id`, `hubungan_keluarga`, `nama_anggota_keluarga`, `tanggal_lahir_anggota_keluarga`) VALUES (3, 'Ibu', 'Dita', '2024-10-01')
---
    public function store()
    {

        // Simpan data karyawan
        $employeeData = [
            'nama_karyawan' => $this->request->getVar('nama_karyawan'),
            'tanggal_lahir' => $this->request->getVar('tanggal_lahir'),
            'alamat' => $this->request->getVar('alamat'),
            'valid_from' => date('Y-m-d'), // Set valid_from to current date
        ];

        // Insert employee data and get the employee ID
        $employeeId = $this->employeeModel->insert($employeeData);

        // Simpan data anggota keluarga
        $hubunganKeluarga = $this->request->getVar('hubungan_keluarga');
        $namaKeluarga = $this->request->getVar('nama_keluarga');
        $tanggalLahirKeluarga = $this->request->getVar('tanggal_lahir_keluarga');

        for ($i = 0; $i < count($hubunganKeluarga); $i++) {
            if (!empty($hubunganKeluarga[$i]) && !empty($namaKeluarga[$i])) {
                $familyData = [
                    'm_employee_id' => $employeeId,
                    'hubungan_keluarga' => $hubunganKeluarga[$i],
                    'nama_anggota_keluarga' => $namaKeluarga[$i],
                    'tanggal_lahir_anggota_keluarga' => $tanggalLahirKeluarga[$i],
                ];
                $this->familyModel->insert($familyData);

SELECT *
FROM `m_family`
WHERE `m_employee_id` = '1'
---
    public function edit($id = null)
    {
        $employee = $this->employeeModel->find($id);
        $family_members = $this->familyModel->where('m_employee_id', $id)->findAll();

UPDATE `m_employee` SET `nama_karyawan` = 'test', `tanggal_lahir` = '2024-10-01', `alamat` = 'adadasd', `update_by` = 1
WHERE `m_employee`.`m_employee_id` IN ('1')
DELETE FROM `m_family`
WHERE `m_employee_id` = '1'
INSERT INTO `m_family` (`m_employee_id`, `hubungan_keluarga`, `nama_anggota_keluarga`, `tanggal_lahir_anggota_keluarga`) VALUES ('1', 'Anak', 'asdd', '2024-10-07')
---
    public function update($id = null)
    {
        // Update data karyawan
        $employeeData = [
            'nama_karyawan' => $this->request->getVar('nama_karyawan'),
            'tanggal_lahir' => $this->request->getVar('tanggal_lahir'),
            'alamat' => $this->request->getVar('alamat'),
            'update_by' => 1, // Ganti dengan ID pengguna yang sebenarnya
            'update_date' => date('Y-m-d H:i:s')
        ];

        $this->employeeModel->update($id, $employeeData);

        // Hapus anggota keluarga yang sudah ada (untuk update)
        $this->familyModel->where('m_employee_id', $id)->delete();

        // Simpan data anggota keluarga yang baru
        $hubunganKeluarga = $this->request->getVar('hubungan_keluarga');
        $namaKeluarga = $this->request->getVar('nama_keluarga');
        $tanggalLahirKeluarga = $this->request->getVar('tanggal_lahir_keluarga');

        for ($i = 0; $i < count($hubunganKeluarga); $i++) {
            if (!empty($hubunganKeluarga[$i]) && !empty($namaKeluarga[$i])) {
                $familyData = [
                    'm_employee_id' => $id,
                    'hubungan_keluarga' => $hubunganKeluarga[$i],
                    'nama_anggota_keluarga' => $namaKeluarga[$i],
                    'tanggal_lahir_anggota_keluarga' => $tanggalLahirKeluarga[$i],
                ];
                $this->familyModel->insert($familyData);